#include <iostream>
#include <math.h>
#include <stdio.h>
#define E 10-4 // точность

using namespace std;

int main()
{
    setlocale(LC_ALL, ""); // Для отображение Кириллицы
    double eps, sum, n, a, an;
        eps = 0.0001;
        sum = 0.0;
        n = 0.0;
        a = 1.0;

//---------------------------------------------------\\

    cout << "  ______________________________ " << endl;
    cout << " |                              |" << endl;
    cout << " |    Лабораторная работа № 2   |" << endl;
    cout << " |                              |" << endl;
    cout << " |          Вариант № 7         |" << endl;
    cout << " |                              |" << endl;
    cout << " |    Выполнил: Займогов В.Д.   |" << endl;
    cout << " |______________________________|" << endl;
    cout << endl;

//---------------------------------------------------\\

    cout << "> Введите значение n" << endl;
    cout << "> ";
    cin >> n;
    cout << endl;

//---------------------------------------------------\\

    while (abs (a) >= eps) {
        a=(double)1/((3*n-2)*(3*n+1));
        n++;
        sum += a;
    }

 //---------------------------------------------------\\

    cout << "> Сумма ряда, равна: " << sum << endl;

    return 0;
}
