#include <iostream>
#include <clocale>
#include <math.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, ""); // Для отображение Кириллицы
    double result;
    double f=0, z=0, a=0, b=0;

//---------------------------------------------------\\

    cout << "  ______________________________" << endl;
    cout << " |                              |" << endl;
    cout << " |    Лабораторная работа № 1   |" << endl;
    cout << " |         Задача  № 1          |" << endl;
    cout << " |                              |" << endl;
    cout << " |         Вариант № 7          |" << endl;
    cout << " |                              |" << endl;
    cout << " |    Выполнил: Займогов В.Д.   |" << endl;
    cout << " |______________________________|" << endl;
    cout << " |                              |" << endl;
    cout << " | В моём варианте сказано, что |" << endl;
    cout << " | Значение A = 1000            |" << endl;
    cout << " | Значение B = 0.001           |" << endl;
    cout << " |                              |" << endl;
    cout << " | Но вы можете ввести другие.  |" << endl;
    cout << " |______________________________|" << endl;
    cout << endl;

//---------------------------------------------------\\

    cout << "> Введите значение A" << endl;
    cout << "> ";
    cin >> a;
    cout << endl;

    cout << "> Введите значение B" << endl;
    cout << "> ";
    cin >> b;
    cout << endl;

 //=================Начало выражения================\\
//---------------------------------------------------\\

       z = pow(a-b,3); // Упращение выражений. Назначил буквами Z | F
       f = pow(b,3)-3*a*pow(b,2)-3*pow(a,2)*b;
       result = z-pow(a,3)/f; // Упращенная форумула

//---------------------------------------------------\\

    cout << "> Ответ: " << result << endl; // Выведение результата на экран

    return 0;
}
