#include <iostream>
#include <iomanip>
#include <cmath>

#define NewLine1 "   _____________________________________________________________\n"
#define NewLine2 "  |                                                             |\n"
#define NewLine3 "  |_____________________________________________________________|\n\n"


using namespace std;


int main()
{
    setlocale(LC_ALL, ""); // Для отображение Кирилицы

//---------------------------------------------------\\

    cout << "\t\t ______________________________ \n";
    cout << "\t\t|                              |\n";
    cout << "\t\t|    Лабораторная работа № 3   |\n";
    cout << "\t\t|                              |\n";
    cout << "\t\t|          Вариант № 7         |\n";
    cout << "\t\t|                              |\n";
    cout << "\t\t|    Выполнил: Займогов В.Д.   |\n";
    cout << "\t\t|______________________________|\n";
    cout << endl;

//---------------------------------------------------\\

    int k=10, n=10, j;
    double a=0.1, b=1., h=(b-a)/k, an, SN, SE, eps=0.0001, Y;

//---------------------------------------------------\\

    cout << NewLine1;
    cout << NewLine2;

//---------------------------------------------------\\

    for (double x=a; x<=b+h/2.; x+=h)
    {
        an=1.;
        SN=1.;

        for (int i = 1; i < n; i++)
        {
            an*=-x*x/(2.*i*(2.*i-1.));
            SN+=an;
        }

        j=1;
        an=1.;
        SE=1.;
        while(fabs(an)>eps)
        {
            an*=-x*x/(2.*j*(2.*j-1.));
            SE+=an;
            j++;
        }

        Y=cos(x);

        cout << setprecision(2) << fixed << "  |  X= " << x << setprecision(6)
        << "  |  SN= " << SN << "  |  SE= " << SE << "  |  Y= " << Y << "  |\n";
    }

//---------------------------------------------------\\

    cout << NewLine3;

//---------------------------------------------------\\

    system("pause");
    return 0;
}
