#include <iostream>
#include <string>
#include <algorithm>
#include <sstream>

using namespace std;

int main()
{
    setlocale(LC_ALL, ""); // Для отображение Кирилицы, но только для русского отображения. Не будет работать при вводе русского текста в программу

//---------------------------------------------------\\

    cout << "  ______________________________ \n";
    cout << " |                              |\n";
    cout << " |    Лабораторная работа № 6   |\n";
    cout << " |                              |\n";
    cout << " |          Вариант № 7         |\n";
    cout << " |                              |\n";
    cout << " |    Выполнил: Займогов В.Д.   |\n";
    cout << " |______________________________|________________________ \n";
    cout << " |                                                       |\n";
    cout << " |  Не будет работать с Кириллицей. ВВодите англ. текст  |\n";
    cout << " |_______________________________________________________|\n\n";

//---------------------------------------------------\\

    cout << ">> Введите любое слово, либо предложение, либо же цифры" << endl;
    string str;
    getline(cin, str);

//---------------------------------------------------\\

    stringstream ss(str);
    string word, newStr;

//---------------------------------------------------\\

    while (ss >> word) // разбитие строки на слова
    {
        sort(word.begin(), word.end()); // сортировка букв/цифр в наборе
        newStr += word + " "; // формируем новую строку
    }

//---------------------------------------------------\\

    cout << "\n>> Полученая комбинация" << endl;
    cout << newStr << endl;

//---------------------------------------------------\\

    return 0;
}
