#include <iostream>
#include <ctime>
#include <cstdio>
#include <cstdlib>

using namespace std;

int size = 0; // ðàçìåð ìàññèâà

int main()
{

    setlocale(LC_ALL, ""); // Äëÿ îòîáðàæåíèå Êèðèëèöû, íî òîëüêî äëÿ ðóññêîãî îòîáðàæåíèÿ. Íå áóäåò ðàáîòàòü ïðè ââîäå ðóññêîãî òåêñòà â ïðîãðàììó
    srand(time(NULL));

//---------------------------------------------------\\

    cout << "  ______________________________ \n";
    cout << " |                              |\n";
    cout << " |    Ëàáîðàòîðíàÿ ðàáîòà ¹ 4   |\n";
    cout << " |                              |\n";
    cout << " |          Âàðèàíò ¹ 7         |\n";
    cout << " |                              |\n";
    cout << " |    Âûïîëíèë: Çàéìîãîâ Â.Ä.   |\n";
    cout << " |______________________________|\n\n";

//---------------------------------------------------\\

    cout << " ____________________________________________________ \n";
    cout << "|                                                    |\n";
    cout << "|         Ãåíåðàöèÿ ñëó÷àéíûõ ÷èñåë â ìàññèâå        |\n";
    cout << "|____________________________________________________|\n\n";


//---------------------------------------------------\\

    cout << ">> Ââåäèòå ðàçìåð ìàññèâà: ";
    cin >> size;

//---------------------------------------------------\\

    int *array = new int[size];

    for (int i=0;i<size;i++)
    {
        array[i] = rand()%10;
    }

//---------------------------------------------------\\

    int ind = 0;
    for (int i=0; i<size; i++)
    {
        cout << array[i] << " ";
        //îïðåäåëåíèå èíäåêñà ïîñëåäíåãî íóëåâîãî ýëåìåíòà
        if (array[i] == 0)
        {
            ind = i;
        }
    }
    cout << endl << endl;

    //óäàëåíèå ïîñëåäíåãî íóëåâîãî
    for (int i = ind; i<size; i++)
    {
        array[i] = array[i+1];
    }

//---------------------------------------------------\\

    cout << " ____________________________________________________ \n";
    cout << "|                                                    |\n";
    cout << "| Èä¸ò óäàëåíèå ïîñëåäíåãî ýëåìåíòà, êîòîðîå ðàâíî 0 |\n";
    cout << "|____________________________________________________|\n";


//---------------------------------------------------\\

    //Âûâîä ïðåîáðàçîâàííîãî ìàññèâà
    cout << "\n>> Ïðåîáðàçîâàííûé ìàññèâ:\n";
    for (int i=0; i<size-1; i++)

    {
        cout << array[i] << " ";
    }
    cout << endl << endl;

//---------------------------------------------------\\

    cout << " ____________________________________________________ \n";
    cout << "|                                                    |\n";
    cout << "|        Äîáàâëåíèå ýëåìåíòà 100 â ìàññèâ            |\n";
    cout << "|____________________________________________________|\n\n";


//---------------------------------------------------\\

    cout << ">> Ââåäèòå íîìåð ýëåìåíòà, ïîñëå êîòîðîãî \n>> âû õîòèòå âñòàâèòü ýëåìåíò ñî çíà÷åíèåì <100>: ";
    int number;
    cin >> number;


    for (int i=size-1; i > number; i--)
    {
        array[i] = array[i-1];
    }
    array[number] = 100;


    //Âûâîä ïðåîáðàçîâàííîãî ìàññèâà
    cout << "\n>> Ïðåîáðàçîâàííûé ìàññèâ:\n";
    for (int i=0; i<size; i++)
    {
        cout << array[i] << " ";
    }
    cout << endl;

//---------------------------------------------------\\

    return 0;
}
